#### Terraform Format and Style 🖌`failure`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`failure`

<details><summary>Show Plan</summary>

```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform planned the following actions, but then encountered a problem:

  # tls_private_key.hetzner_private_key will be created
  + resource "tls_private_key" "hetzner_private_key" {
      + algorithm                     = "ED25519"
      + ecdsa_curve                   = "P224"
      + id                            = (known after apply)
      + private_key_openssh           = (sensitive value)
      + private_key_pem               = (sensitive value)
      + private_key_pem_pkcs8         = (sensitive value)
      + public_key_fingerprint_md5    = (known after apply)
      + public_key_fingerprint_sha256 = (known after apply)
      + public_key_openssh            = (known after apply)
      + public_key_pem                = (known after apply)
      + rsa_bits                      = 2048
    }

  # module.dns.digitalocean_domain.immoly-io will be created
  + resource "digitalocean_domain" "immoly-io" {
      + id   = (known after apply)
      + name = "immoly.io"
      + ttl  = (known after apply)
      + urn  = (known after apply)
    }

  # module.dns.digitalocean_domain.jakob-lingel-dev will be created
  + resource "digitalocean_domain" "jakob-lingel-dev" {
      + id   = (known after apply)
      + name = "jakob-lingel.dev"
      + ttl  = (known after apply)
      + urn  = (known after apply)
    }

  # module.dns.digitalocean_domain.mimis_kreativstudio_de will be created
  + resource "digitalocean_domain" "mimis_kreativstudio_de" {
      + id   = (known after apply)
      + name = "mimis-kreativstudio.de"
      + ttl  = (known after apply)
      + urn  = (known after apply)
    }

  # module.dns.digitalocean_domain.schluesselmomente_freiburg_de will be created
  + resource "digitalocean_domain" "schluesselmomente_freiburg_de" {
      + id   = (known after apply)
      + name = "schluesselmomente-freiburg.de"
      + ttl  = (known after apply)
      + urn  = (known after apply)
    }

  # module.dns.digitalocean_domain.teachly_store will be created
  + resource "digitalocean_domain" "teachly_store" {
      + id   = (known after apply)
      + name = "teachly.store"
      + ttl  = (known after apply)
      + urn  = (known after apply)
    }

  # module.dns.digitalocean_record.immoly_io_A will be created
  + resource "digitalocean_record" "immoly_io_A" {
      + domain = "immoly.io"
      + fqdn   = (known after apply)
      + id     = (known after apply)
      + name   = "@"
      + ttl    = 1800
      + type   = "A"
      + value  = "49.13.45.106"
    }

  # module.dns.digitalocean_record.immoly_io_alemazung_CNAME will be created
  + resource "digitalocean_record" "immoly_io_alemazung_CNAME" {
      + domain = "immoly.io"
      + fqdn   = (known after apply)
      + id     = (known after apply)
      + name   = "alemazung"
      + ttl    = 1800
      + type   = "CNAME"
      + value  = "immoly.io."
    }

  # module.dns.digitalocean_record.immoly_io_api_alemazung_CNAME will be created
  + resource "digitalocean_record" "immoly_io_api_alemazung_CNAME" {
      + domain = "immoly.io"
      + fqdn   = (known after apply)
      + id     = (known after apply)
      + name   = "api.alemazung"
      + ttl    = 1800
      + type   = "CNAME"
      + value  = "immoly.io."
    }

  # module.dns.digitalocean_record.immoly_io_blog_CNAME will be created
  + resource "digitalocean_record" "immoly_io_blog_CNAME" {
      + domain = "immoly.io"
      + fqdn   = (known after apply)
      + id     = (known after apply)
      + name   = "blog"
      + ttl    = 1800
      + type   = "CNAME"
      + value  = "immoly.io."
    }

  # module.dns.digitalocean_record.immoly_io_google_verification will be created
  + resource "digitalocean_record" "immoly_io_google_verification" {
      + domain = "immoly.io"
      + fqdn   = (known after apply)
      + id     = (known after apply)
      + name   = "@"
      + ttl    = 1800
      + type   = "TXT"
      + value  = "google-site-verification=4JEzmJ-pAhowMTRZCZNCTa-nrL2HKT3casSXqD21GZc"
    }

  # module.dns.digitalocean_record.immoly_io_ns1 will be created
  + resource "digitalocean_record" "immoly_io_ns1" {
      + domain = "immoly.io"
      + fqdn   = (known after apply)
      + id     = (known after apply)
      + name   = "@"
      + ttl    = 1800
      + type   = "NS"
      + value  = "ns1.digitalocean.com."
    }

  # module.dns.digitalocean_record.immoly_io_ns2 will be created
  + resource "digitalocean_record" "immoly_io_ns2" {
      + domain = "immoly.io"
      + fqdn   = (known after apply)
      + id     = (known after apply)
      + name   = "@"
      + ttl    = 1800
      + type   = "NS"
      + value  = "ns2.digitalocean.com."
    }

  # module.dns.digitalocean_record.immoly_io_ns3 will be created
  + resource "digitalocean_record" "immoly_io_ns3" {
      + domain = "immoly.io"
      + fqdn   = (known after apply)
      + id     = (known after apply)
      + name   = "@"
      + ttl    = 1800
      + type   = "NS"
      + value  = "ns3.digitalocean.com."
    }

  # module.dns.digitalocean_record.immoly_io_www_A will be created
  + resource "digitalocean_record" "immoly_io_www_A" {
      + domain = "immoly.io"
      + fqdn   = (known after apply)
      + id     = (known after apply)
      + name   = "www"
      + ttl    = 1800
      + type   = "A"
      + value  = "49.13.45.106"
    }

  # module.dns.digitalocean_record.immoly_io_www_alemazung_CNAME will be created
  + resource "digitalocean_record" "immoly_io_www_alemazung_CNAME" {
      + domain = "immoly.io"
      + fqdn   = (known after apply)
      + id     = (known after apply)
      + name   = "www.alemazung"
      + ttl    = 1800
      + type   = "CNAME"
      + value  = "immoly.io."
    }

  # module.dns.digitalocean_record.immoly_io_www_api_alemazung_CNAME will be created
  + resource "digitalocean_record" "immoly_io_www_api_alemazung_CNAME" {
      + domain = "immoly.io"
      + fqdn   = (known after apply)
      + id     = (known after apply)
      + name   = "www.api.alemazung"
      + ttl    = 1800
      + type   = "CNAME"
      + value  = "immoly.io."
    }

  # module.dns.digitalocean_record.jakob_lingel_dev_A will be created
  + resource "digitalocean_record" "jakob_lingel_dev_A" {
      + domain = "jakob-lingel.dev"
      + fqdn   = (known after apply)
      + id     = (known after apply)
      + name   = "@"
      + ttl    = 1800
      + type   = "A"
      + value  = "49.13.45.106"
    }

  # module.dns.digitalocean_record.jakob_lingel_dev_alemazung will be created
  + resource "digitalocean_record" "jakob_lingel_dev_alemazung" {
      + domain = "jakob-lingel.dev"
      + fqdn   = (known after apply)
      + id     = (known after apply)
      + name   = "alemazung"
      + ttl    = 1800
      + type   = "CNAME"
      + value  = "jakob-lingel.dev."
    }

  # module.dns.digitalocean_record.jakob_lingel_dev_analytics will be created
  + resource "digitalocean_record" "jakob_lingel_dev_analytics" {
      + domain = "jakob-lingel.dev"
      + fqdn   = (known after apply)
      + id     = (known after apply)
      + name   = "analytics"
      + ttl    = 1800
      + type   = "CNAME"
      + value  = "jakob-lingel.dev."
    }

  # module.dns.digitalocean_record.jakob_lingel_dev_argocd will be created
  + resource "digitalocean_record" "jakob_lingel_dev_argocd" {
      + domain = "jakob-lingel.dev"
      + fqdn   = (known after apply)
      + id     = (known after apply)
      + name   = "argocd"
      + ttl    = 1800
      + type   = "CNAME"
      + value  = "jakob-lingel.dev."
    }

  # module.dns.digitalocean_record.jakob_lingel_dev_blog_CNAME will be created
  + resource "digitalocean_record" "jakob_lingel_dev_blog_CNAME" {
      + domain = "jakob-lingel.dev"
      + fqdn   = (known after apply)
      + id     = (known after apply)
      + name   = "blog"
      + ttl    = 1800
      + type   = "CNAME"
      + value  = "jakob-lingel.dev."
    }

  # module.dns.digitalocean_record.jakob_lingel_dev_immoly_CNAME will be created
  + resource "digitalocean_record" "jakob_lingel_dev_immoly_CNAME" {
      + domain = "jakob-lingel.dev"
      + fqdn   = (known after apply)
      + id     = (known after apply)
      + name   = "immoly"
      + ttl    = 1800
      + type   = "CNAME"
      + value  = "jakob-lingel.dev."
    }

  # module.dns.digitalocean_record.jakob_lingel_dev_immoly_google_verification will be created
  + resource "digitalocean_record" "jakob_lingel_dev_immoly_google_verification" {
      + domain = "jakob-lingel.dev"
      + fqdn   = (known after apply)
      + id     = (known after apply)
      + name   = "@"
      + ttl    = 1800
      + type   = "TXT"
      + value  = "google-site-verification=-rHm-rqCZBUxj6dSYIX1j722sREMP0wNw9gDLQDWn_Q"
    }

  # module.dns.digitalocean_record.jakob_lingel_dev_ns1 will be created
  + resource "digitalocean_record" "jakob_lingel_dev_ns1" {
      + domain = "jakob-lingel.dev"
      + fqdn   = (known after apply)
      + id     = (known after apply)
      + name   = "@"
      + ttl    = 1800
      + type   = "NS"
      + value  = "ns1.digitalocean.com."
    }

  # module.dns.digitalocean_record.jakob_lingel_dev_ns2 will be created
  + resource "digitalocean_record" "jakob_lingel_dev_ns2" {
      + domain = "jakob-lingel.dev"
      + fqdn   = (known after apply)
      + id     = (known after apply)
      + name   = "@"
      + ttl    = 1800
      + type   = "NS"
      + value  = "ns2.digitalocean.com."
    }

  # module.dns.digitalocean_record.jakob_lingel_dev_ns3 will be created
  + resource "digitalocean_record" "jakob_lingel_dev_ns3" {
      + domain = "jakob-lingel.dev"
      + fqdn   = (known after apply)
      + id     = (known after apply)
      + name   = "@"
      + ttl    = 1800
      + type   = "NS"
      + value  = "ns3.digitalocean.com."
    }

  # module.dns.digitalocean_record.jakob_lingel_dev_uptime will be created
  + resource "digitalocean_record" "jakob_lingel_dev_uptime" {
      + domain = "jakob-lingel.dev"
      + fqdn   = (known after apply)
      + id     = (known after apply)
      + name   = "uptime"
      + ttl    = 1800
      + type   = "CNAME"
      + value  = "jakob-lingel.dev."
    }

  # module.dns.digitalocean_record.jakob_lingel_dev_www_A will be created
  + resource "digitalocean_record" "jakob_lingel_dev_www_A" {
      + domain = "jakob-lingel.dev"
      + fqdn   = (known after apply)
      + id     = (known after apply)
      + name   = "www"
      + ttl    = 1800
      + type   = "A"
      + value  = "49.13.45.106"
    }

  # module.dns.digitalocean_record.jakob_lingel_dev_www_analytics will be created
  + resource "digitalocean_record" "jakob_lingel_dev_www_analytics" {
      + domain = "jakob-lingel.dev"
      + fqdn   = (known after apply)
      + id     = (known after apply)
      + name   = "www.analytics"
      + ttl    = 1800
      + type   = "CNAME"
      + value  = "analytics.jakob-lingel.dev."
    }

  # module.dns.digitalocean_record.jakob_lingel_dev_www_argocd will be created
  + resource "digitalocean_record" "jakob_lingel_dev_www_argocd" {
      + domain = "jakob-lingel.dev"
      + fqdn   = (known after apply)
      + id     = (known after apply)
      + name   = "www.argocd"
      + ttl    = 1800
      + type   = "CNAME"
      + value  = "argocd.jakob-lingel.dev."
    }

  # module.dns.digitalocean_record.jakob_lingel_dev_www_blog_CNAME will be created
  + resource "digitalocean_record" "jakob_lingel_dev_www_blog_CNAME" {
      + domain = "jakob-lingel.dev"
      + fqdn   = (known after apply)
      + id     = (known after apply)
      + name   = "www.blog"
      + ttl    = 1800
      + type   = "CNAME"
      + value  = "blog.jakob-lingel.dev."
    }

  # module.dns.digitalocean_record.jakob_lingel_dev_www_uptime will be created
  + resource "digitalocean_record" "jakob_lingel_dev_www_uptime" {
      + domain = "jakob-lingel.dev"
      + fqdn   = (known after apply)
      + id     = (known after apply)
      + name   = "www.uptime"
      + ttl    = 1800
      + type   = "CNAME"
      + value  = "uptime.jakob-lingel.dev."
    }

  # module.dns.digitalocean_record.mimis_kreativstudio_de_A will be created
  + resource "digitalocean_record" "mimis_kreativstudio_de_A" {
      + domain = "mimis-kreativstudio.de"
      + fqdn   = (known after apply)
      + id     = (known after apply)
      + name   = "@"
      + ttl    = 1800
      + type   = "A"
    }

  # module.dns.digitalocean_record.mimis_kreativstudio_de_ns1 will be created
  + resource "digitalocean_record" "mimis_kreativstudio_de_ns1" {
      + domain = "mimis-kreativstudio.de"
      + fqdn   = (known after apply)
      + id     = (known after apply)
      + name   = "@"
      + ttl    = 1800
      + type   = "NS"
      + value  = "ns1.digitalocean.com."
    }

  # module.dns.digitalocean_record.mimis_kreativstudio_de_ns2 will be created
  + resource "digitalocean_record" "mimis_kreativstudio_de_ns2" {
      + domain = "mimis-kreativstudio.de"
      + fqdn   = (known after apply)
      + id     = (known after apply)
      + name   = "@"
      + ttl    = 1800
      + type   = "NS"
      + value  = "ns2.digitalocean.com."
    }

  # module.dns.digitalocean_record.mimis_kreativstudio_de_ns3 will be created
  + resource "digitalocean_record" "mimis_kreativstudio_de_ns3" {
      + domain = "mimis-kreativstudio.de"
      + fqdn   = (known after apply)
      + id     = (known after apply)
      + name   = "@"
      + ttl    = 1800
      + type   = "NS"
      + value  = "ns3.digitalocean.com."
    }

  # module.dns.digitalocean_record.mimis_kreativstudio_de_www_A will be created
  + resource "digitalocean_record" "mimis_kreativstudio_de_www_A" {
      + domain = "mimis-kreativstudio.de"
      + fqdn   = (known after apply)
      + id     = (known after apply)
      + name   = "www"
      + ttl    = 1800
      + type   = "A"
    }

  # module.dns.digitalocean_record.schluesselmomente_freiburg_de_admin_a will be created
  + resource "digitalocean_record" "schluesselmomente_freiburg_de_admin_a" {
      + domain = "schluesselmomente-freiburg.de"
      + fqdn   = (known after apply)
      + id     = (known after apply)
      + name   = "admin"
      + ttl    = 3600
      + type   = "A"
    }

  # module.dns.digitalocean_record.schluesselmomente_freiburg_de_api_a will be created
  + resource "digitalocean_record" "schluesselmomente_freiburg_de_api_a" {
      + domain = "schluesselmomente-freiburg.de"
      + fqdn   = (known after apply)
      + id     = (known after apply)
      + name   = "api"
      + ttl    = 3600
      + type   = "A"
    }

  # module.dns.digitalocean_record.schluesselmomente_freiburg_de_mx1 will be created
  + resource "digitalocean_record" "schluesselmomente_freiburg_de_mx1" {
      + domain   = "schluesselmomente-freiburg.de"
      + fqdn     = (known after apply)
      + id       = (known after apply)
      + name     = "@"
      + priority = 10
      + ttl      = 3600
      + type     = "MX"
      + value    = "mx.zoho.eu."
    }

  # module.dns.digitalocean_record.schluesselmomente_freiburg_de_mx2 will be created
  + resource "digitalocean_record" "schluesselmomente_freiburg_de_mx2" {
      + domain   = "schluesselmomente-freiburg.de"
      + fqdn     = (known after apply)
      + id       = (known after apply)
      + name     = "@"
      + priority = 20
      + ttl      = 3600
      + type     = "MX"
      + value    = "mx2.zoho.eu."
    }

  # module.dns.digitalocean_record.schluesselmomente_freiburg_de_mx3 will be created
  + resource "digitalocean_record" "schluesselmomente_freiburg_de_mx3" {
      + domain   = "schluesselmomente-freiburg.de"
      + fqdn     = (known after apply)
      + id       = (known after apply)
      + name     = "@"
      + priority = 50
      + ttl      = 3600
      + type     = "MX"
      + value    = "mx3.zoho.eu."
    }

  # module.dns.digitalocean_record.schluesselmomente_freiburg_de_ns1 will be created
  + resource "digitalocean_record" "schluesselmomente_freiburg_de_ns1" {
      + domain = "schluesselmomente-freiburg.de"
      + fqdn   = (known after apply)
      + id     = (known after apply)
      + name   = "@"
      + ttl    = 1800
      + type   = "NS"
      + value  = "ns1.digitalocean.com."
    }

  # module.dns.digitalocean_record.schluesselmomente_freiburg_de_ns2 will be created
  + resource "digitalocean_record" "schluesselmomente_freiburg_de_ns2" {
      + domain = "schluesselmomente-freiburg.de"
      + fqdn   = (known after apply)
      + id     = (known after apply)
      + name   = "@"
      + ttl    = 1800
      + type   = "NS"
      + value  = "ns2.digitalocean.com."
    }

  # module.dns.digitalocean_record.schluesselmomente_freiburg_de_ns3 will be created
  + resource "digitalocean_record" "schluesselmomente_freiburg_de_ns3" {
      + domain = "schluesselmomente-freiburg.de"
      + fqdn   = (known after apply)
      + id     = (known after apply)
      + name   = "@"
      + ttl    = 1800
      + type   = "NS"
      + value  = "ns3.digitalocean.com."
    }

  # module.dns.digitalocean_record.schluesselmomente_freiburg_de_root_a will be created
  + resource "digitalocean_record" "schluesselmomente_freiburg_de_root_a" {
      + domain = "schluesselmomente-freiburg.de"
      + fqdn   = (known after apply)
      + id     = (known after apply)
      + name   = "@"
      + ttl    = 3600
      + type   = "A"
      + value  = "49.13.45.106"
    }

  # module.dns.digitalocean_record.schluesselmomente_freiburg_de_s1_dkim_txt will be created
  + resource "digitalocean_record" "schluesselmomente_freiburg_de_s1_dkim_txt" {
      + domain = "schluesselmomente-freiburg.de"
      + fqdn   = (known after apply)
      + id     = (known after apply)
      + name   = "s1._domainkey"
      + ttl    = 3600
      + type   = "TXT"
    }

  # module.dns.digitalocean_record.schluesselmomente_freiburg_de_spf_txt will be created
  + resource "digitalocean_record" "schluesselmomente_freiburg_de_spf_txt" {
      + domain = "schluesselmomente-freiburg.de"
      + fqdn   = (known after apply)
      + id     = (known after apply)
      + name   = "@"
      + ttl    = 3600
      + type   = "TXT"
    }

  # module.dns.digitalocean_record.schluesselmomente_freiburg_de_www_a will be created
  + resource "digitalocean_record" "schluesselmomente_freiburg_de_www_a" {
      + domain = "schluesselmomente-freiburg.de"
      + fqdn   = (known after apply)
      + id     = (known after apply)
      + name   = "www"
      + ttl    = 3600
      + type   = "A"
      + value  = "49.13.45.106"
    }

  # module.dns.digitalocean_record.schluesselmomente_freiburg_de_www_admin_a will be created
  + resource "digitalocean_record" "schluesselmomente_freiburg_de_www_admin_a" {
      + domain = "schluesselmomente-freiburg.de"
      + fqdn   = (known after apply)
      + id     = (known after apply)
      + name   = "www.admin"
      + ttl    = 3600
      + type   = "A"
    }

  # module.dns.digitalocean_record.schluesselmomente_freiburg_de_zmail_dkim_txt will be created
  + resource "digitalocean_record" "schluesselmomente_freiburg_de_zmail_dkim_txt" {
      + domain = "schluesselmomente-freiburg.de"
      + fqdn   = (known after apply)
      + id     = (known after apply)
      + name   = "zmail._domainkey"
      + ttl    = 3600
      + type   = "TXT"
    }

  # module.dns.digitalocean_record.schluesselmomente_freiburg_de_zoho_verification_txt will be created
  + resource "digitalocean_record" "schluesselmomente_freiburg_de_zoho_verification_txt" {
      + domain = "schluesselmomente-freiburg.de"
      + fqdn   = (known after apply)
      + id     = (known after apply)
      + name   = "@"
      + ttl    = 3600
      + type   = "TXT"
    }

  # module.dns.digitalocean_record.teachly_store_auth_cname will be created
  + resource "digitalocean_record" "teachly_store_auth_cname" {
      + domain = "teachly.store"
      + fqdn   = (known after apply)
      + id     = (known after apply)
      + name   = "auth"
      + ttl    = 43200
      + type   = "CNAME"
      + value  = "@"
    }

  # module.dns.digitalocean_record.teachly_store_blog_cname will be created
  + resource "digitalocean_record" "teachly_store_blog_cname" {
      + domain = "teachly.store"
      + fqdn   = (known after apply)
      + id     = (known after apply)
      + name   = "blog"
      + ttl    = 43200
      + type   = "CNAME"
      + value  = "@"
    }

  # module.dns.digitalocean_record.teachly_store_netlify_challenge_txt will be created
  + resource "digitalocean_record" "teachly_store_netlify_challenge_txt" {
      + domain = "teachly.store"
      + fqdn   = (known after apply)
      + id     = (known after apply)
      + name   = "netlify-challenge"
      + ttl    = 3600
      + type   = "TXT"
    }

  # module.dns.digitalocean_record.teachly_store_ns1 will be created
  + resource "digitalocean_record" "teachly_store_ns1" {
      + domain = "teachly.store"
      + fqdn   = (known after apply)
      + id     = (known after apply)
      + name   = "@"
      + ttl    = 1800
      + type   = "NS"
      + value  = "ns1.digitalocean.com."
    }

  # module.dns.digitalocean_record.teachly_store_ns2 will be created
  + resource "digitalocean_record" "teachly_store_ns2" {
      + domain = "teachly.store"
      + fqdn   = (known after apply)
      + id     = (known after apply)
      + name   = "@"
      + ttl    = 1800
      + type   = "NS"
      + value  = "ns2.digitalocean.com."
    }

  # module.dns.digitalocean_record.teachly_store_ns3 will be created
  + resource "digitalocean_record" "teachly_store_ns3" {
      + domain = "teachly.store"
      + fqdn   = (known after apply)
      + id     = (known after apply)
      + name   = "@"
      + ttl    = 1800
      + type   = "NS"
      + value  = "ns3.digitalocean.com."
    }

  # module.dns.digitalocean_record.teachly_store_portfolio_cname will be created
  + resource "digitalocean_record" "teachly_store_portfolio_cname" {
      + domain = "teachly.store"
      + fqdn   = (known after apply)
      + id     = (known after apply)
      + name   = "portfolio"
      + ttl    = 43200
      + type   = "CNAME"
      + value  = "clever-pasca-29d973.netlify.app."
    }

  # module.dns.digitalocean_record.teachly_store_root_a will be created
  + resource "digitalocean_record" "teachly_store_root_a" {
      + domain = "teachly.store"
      + fqdn   = (known after apply)
      + id     = (known after apply)
      + name   = "@"
      + ttl    = 3600
      + type   = "A"
    }

  # module.dns.digitalocean_record.teachly_store_www_a will be created
  + resource "digitalocean_record" "teachly_store_www_a" {
      + domain = "teachly.store"
      + fqdn   = (known after apply)
      + id     = (known after apply)
      + name   = "www"
      + ttl    = 3600
      + type   = "A"
    }

  # module.dns.digitalocean_record.teachly_store_www_auth_cname will be created
  + resource "digitalocean_record" "teachly_store_www_auth_cname" {
      + domain = "teachly.store"
      + fqdn   = (known after apply)
      + id     = (known after apply)
      + name   = "www.auth"
      + ttl    = 43200
      + type   = "CNAME"
      + value  = "@"
    }

  # module.dns.digitalocean_record.teachly_store_www_blog_cname will be created
  + resource "digitalocean_record" "teachly_store_www_blog_cname" {
      + domain = "teachly.store"
      + fqdn   = (known after apply)
      + id     = (known after apply)
      + name   = "www.blog"
      + ttl    = 43200
      + type   = "CNAME"
      + value  = "@"
    }

Plan: 64 to add, 0 to change, 0 to destroy.

```

</details>

*Pushed by: @Davidcode2, Action: `pull_request`*